fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВыполненныеКлиентуРаботы/ВКМ_ВыполненныеКлиентуРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеКлиентуРаботы</name>
  <resources>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбоненскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_НачалоПериодаДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ОкончаниеПериодаДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_АбонентскаяПлата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧаса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ManagerModule.bsl
Процедура СформироватьАктыЗаПериод(Параметры, АдресРезультата) Экспорт
	
	ВыполненныеРаботы = ПолучитьДанныеОВыполненныхРаботахПоАбонентскимДоговорам(Параметры.НачалоПериода, Параметры.КонецПериода);
	
	ВсегоАктов = ВыполненныеРаботы.Количество();
	
	Если ВсегоАктов = 0 Тогда
		Возврат;
	Иначе
		
		ТекДок = 1;
		
		ТаблицаРезультат = Новый ТаблицаЗначений;
		КолонкаТаблицы = ТаблицаРезультат.Колонки.Добавить("Договор");
		КолонкаТаблицы = ТаблицаРезультат.Колонки.Добавить("ДокументРеализации");
		
		Для Каждого ЭлементМассива Из ВыполненныеРаботы Цикл
			
			
			НовыйДокумент = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
			НовыйДокумент.Дата = Параметры.КонецПериода;
			//НовыйДокумент.Записать();
			
			ЭлементМассива.НовыйДокумент = НовыйДокумент;
			НовыйДокумент.Заполнить(ЭлементМассива);
			НовыйДокумент.Записать();
			
			Если НовыйДокумент.ПроверитьЗаполнение() Тогда
				НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;
			
			НоваяСтрока = ТаблицаРезультат.Добавить();
			НоваяСтрока.Договор = ЭлементМассива.Договор;
			НоваяСтрока.ДокументРеализации = НовыйДокумент.Ссылка;
			
			ПроцентВыполнения = (ТекДок / ВсегоАктов) * 100;
			ПроцентВыполнения = Окр(ПроцентВыполнения, 0);
			
			ДлительныеОперации.СообщитьПрогресс(ПроцентВыполнения, СокрЛП(НовыйДокумент.Ссылка));
			
			ТекДок = ТекДок + 1;
			
		КонецЦикла;
		
		МассивДокументов = ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаРезультат);
		
		ПоместитьВоВременноеХранилище(МассивДокументов, АдресРезультата);
		
	КонецЕсли;
		
КонецПроцедуры

Функция ПолучитьДанныеОВыполненныхРаботахПоАбонентскимДоговорам(НачалоПериода, КонецПериода)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка КАК Договор,
		|	ДоговорыКонтрагентов.Организация КАК Организация,
		|	ДоговорыКонтрагентов.Владелец КАК Контрагент,
		|	МАКСИМУМ(ДоговорыКонтрагентов.ВКМ_АбонентскаяПлата) КАК АбонентскаяПлата,
		|	ЕСТЬNULL(СУММА(ВКМ_ВыполненныеКлиентуРаботыОбороты.КоличествоЧасовПриход), 0) КАК Количество,
		|	ЕСТЬNULL(СУММА(ВКМ_ВыполненныеКлиентуРаботыОбороты.СуммаКОплатеПриход), 0) КАК Сумма
		|ПОМЕСТИТЬ ВТ_ИсходныеДанные
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВКМ_ВыполненныеКлиентуРаботы.Обороты(&НачалоПериода, &КонецПериода, Регистратор, ) КАК ВКМ_ВыполненныеКлиентуРаботыОбороты
		|		ПО ДоговорыКонтрагентов.Ссылка = ВКМ_ВыполненныеКлиентуРаботыОбороты.Договор
		|ГДЕ
		|	ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание)
		|	И ДоговорыКонтрагентов.ВКМ_НачалоПериодаДействия <= &НачалоПериода
		|	И КОНЕЦПЕРИОДА(ДоговорыКонтрагентов.ВКМ_ОкончаниеПериодаДействия, ДЕНЬ) >= &КонецПериода
		|
		|СГРУППИРОВАТЬ ПО
		|	ДоговорыКонтрагентов.Ссылка,
		|	ДоговорыКонтрагентов.Владелец,
		|	ДоговорыКонтрагентов.Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
		|	РеализацияТоваровУслуг.Договор КАК Договор
		|ПОМЕСТИТЬ ВТ_Реализация
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	РеализацияТоваровУслуг.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ИсходныеДанные.Договор КАК Договор,
		|	ВТ_ИсходныеДанные.Организация КАК Организация,
		|	ВТ_ИсходныеДанные.Контрагент КАК Контрагент,
		|	ВТ_ИсходныеДанные.АбонентскаяПлата КАК АбонентскаяПлата,
		|	ВТ_ИсходныеДанные.Количество КАК Количество,
		|	ВТ_ИсходныеДанные.Сумма КАК Сумма,
		|	ВТ_Реализация.Ссылка КАК Реализация
		|ИЗ
		|	ВТ_ИсходныеДанные КАК ВТ_ИсходныеДанные
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Реализация КАК ВТ_Реализация
		|		ПО ВТ_ИсходныеДанные.Договор = ВТ_Реализация.Договор
		|ГДЕ
		|	ВТ_Реализация.Ссылка ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ВыполненныеРаботы = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		
		ДанныеПоДоговору = Новый Структура;
		ДанныеПоДоговору.Вставить("Договор", Выборка.Договор);
		ДанныеПоДоговору.Вставить("Организация", Выборка.Организация);
		ДанныеПоДоговору.Вставить("Контрагент", Выборка.Контрагент);
		ДанныеПоДоговору.Вставить("АбонентскаяПлата", Выборка.АбонентскаяПлата);
		ДанныеПоДоговору.Вставить("Количество", Выборка.Количество);
		ДанныеПоДоговору.Вставить("Сумма", Выборка.Сумма);
		ДанныеПоДоговору.Вставить("Реализация", Выборка.Реализация);
		
		ДанныеПоДоговору.Вставить("НовыйДокумент");
		
		ВыполненныеРаботы.Добавить(ДанныеПоДоговору);
		
	КонецЦикла;
	
	Возврат ВыполненныеРаботы;
	
КонецФункции
